Script started on Thu 08 May 2014 12:54:06 AM PDT
You are currently using 32% (156.4 MiB) of your 488.3 MiB quota.
[bambriz@unix1 lab5]$ valgrind[Kd malloc
==501== Memcheck, a memory error detector
==501== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==501== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==501== Command: malloc
==501== 
0x4c28090-> {6, (nil)}
==501== 
==501== HEAP SUMMARY:
==501==     in use at exit: 16 bytes in 1 blocks
==501==   total heap usage: 2 allocs, 1 frees, 32 bytes allocated
==501== 
==501== LEAK SUMMARY:
==501==    definitely lost: 16 bytes in 1 blocks
==501==    indirectly lost: 0 bytes in 0 blocks
==501==      possibly lost: 0 bytes in 0 blocks
==501==    still reachable: 0 bytes in 0 blocks
==501==         suppressed: 0 bytes in 0 blocks
==501== Rerun with --leak-check=full to see details of leaked memory
==501== 
==501== For counts of detected and suppressed errors, rerun with: -v
==501== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 6 from 6)
[bambriz@unix1 lab5]$ gdb malloc
GNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/bambriz/private/cmps012b/lab5/malloc...done.
(gdb) break main
Breakpoint 1 at 0x400594: file malloc.c, line 13.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/u/bambriz/private/cmps012b/lab5/malloc 
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=1, argv=0x7fffffffdd78) at malloc.c:13
13	   node *ptr = malloc (sizeof (struct node));
(gdb) print ptr
$1 = (node *) 0x4004a0 <_start>
(gdb) print *ptr
$2 = {value = -1991643855, link = 0x495450f0e48348e2}
(gdb) next
14	   ptr = malloc (sizeof (node));
(gdb) next
15	   ptr->value = 6;
(gdb) next
16	   ptr->link = NULL;
(gdb) print ptr
$3 = (node *) 0x601030
(gdb) print *ptr
$4 = {value = 6, link = 0x0}
(gdb) next
17	   printf ("%p-> {%d, %p}\n", ptr, ptr->value, ptr->link);
(gdb) next
0x601030-> {6, (nil)}
18	   free (ptr);
(gdb) next
19	   return EXIT_SUCCESS;
(gdb) next
20	}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 512] will be killed.

Quit anyway? (y or n) exit^H^H
Please answer y or n.
A debugging session is active.

	Inferior 1 [process 512] will be killed.

Quit anyway? (y or n) y
[bambriz@unix1 lab5]$ exit
exit

Script done on Thu 08 May 2014 12:56:11 AM PDT
