Script started on Thu 07 Nov 2013 04:06:55 AM PST
You are currently using 31% (152.0 MiB) of your 488.3 MiB quota.
]0;bambriz@unix1:lab5[bambriz@unix1 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/bambriz/private/cmps012b/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005a4: file list2.c, line 14.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/bambriz/private/cmps012b/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffe268) at list2.c:14
14	        for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) print argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffe268
(gdb) print argv[0[[K]
$3 = 0x7fffffffe51f "/afs/cats.ucsc.edu/users/u/bambriz/private/cmps012b/lab5/list2"
(gdb) print argv[1]
$4 = 0x7fffffffe55e "foo"
(gdb) print argv[2]
$5 = 0x7fffffffe562 "bar"
(gdb) print argv[3]
$6 = 0x0
(gdb) print argv[4]
$7 = 0x7fffffffe566 "USER=bambriz"
(gdb) print argv[5]
$8 = 0x7fffffffe573 "LOGNAME=bambriz"
(gdb) print argv[6]
$9 = 0x7fffffffe583 "HOME=/afs/cats.ucsc.edu/users/u/bambriz"
(gdb) print argv[7][K[K[K[K[K[K[K[K[K[K[K[K[Kquit
A debugging session is active.

	Inferior 1 [process 19546] will be killed.

Quit anyway? (y or n) y
]0;bambriz@unix1:lab5[bambriz@unix1 lab5]$ exit
exit

Script done on Thu 07 Nov 2013 04:08:41 AM PST
